// 'use strict';

// •	Какое будет выведено значение: let x = 5; alert( x++ ); ? 5

// •	Чему равно такое выражение: [ ] + false - null + true ? [] == '' => [] + false = 'false' - null = NaN + true = NaN

// •	Что выведет этот код: let y = 1; let x = y = 2; alert(x); ? 2 примитивы передаются справа на лево

// •	Чему равна сумма [ ] + 1 + 2? '12'

// •	Что выведет этот код: alert( "1"[0] )? '1'

// •	Чему равно 2 && 1 && null && 0 && undefined ? null && - запинается на лжи

// •	Есть ли разница между выражениями? !!( a && b ) и (a && b)? Yes boolean !== a or b

// •	Что выведет этот код: alert( null || 2 && 3 || 4 ); ? 3 && приоритет больше чем у ||

// •	a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ? No, они различаются - это 2 разных, но идентичных хранилища

// •	Что выведет этот код: alert( +"Infinity" ); ? int - infinity

// •	Верно ли сравнение: "Ёжик" > "яблоко"? False, я > Ё

// •	Чему равно 0 || "" || 2 || undefined || true || falsе ? 2

